ИИ_Агент/src/Enums/ИИА_ТипСообщения/ИИА_ТипСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_ТипСообщения</name>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/Enums/ИИА_АвторСообщения/ИИА_АвторСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_АвторСообщения</name>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ИИ</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/CommonForms/ИИА_Панель/Module.bsl
&НаКлиенте

#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПриОткрытии(Отказ)
	
	// Получаем или создаем диалог текущего пользователя
	ТекущийДиалог = ИИА_Клиент.НайтиИлиСоздатьДиалогПользователя();
	
	// Загружаем сообщения
	ОбновитьСообщения();
	
	// Устанавливаем начальные значения
	ТекущийТипСообщения = "Чат";
	СтрокаСтатуса = "Модель: gpt-4.1-mini (заглушка)";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура КомандаОтправить(Команда)
	
	Если ПустаяСтрока(ТекущийТекст) Тогда
		Возврат;
	КонецЕсли;
	
	// Отправляем сообщение
	Результат = ИИА_Клиент.ОтправитьСообщение(
		ТекущийДиалог,
		ТекущийТипСообщения,
		ТекущийТекст
	);
	
	// Обновляем список сообщений
	ОбновитьСообщения();
	
	// Обновляем статус по usage
	Если Результат.Usage <> Неопределено Тогда
		Если Результат.Usage.ОстатокКредитов > 0 Тогда
			СтрокаСтатуса = "Осталось " + Формат(Результат.Usage.ОстатокКредитов, "ЧН=0; ЧГ=") + " credits";
		Иначе
			СтрокаСтатуса = "Модель: gpt-4.1-mini";
		КонецЕсли;
	КонецЕсли;
	
	// Очищаем поле ввода
	ТекущийТекст = "";
	
КонецПроцедуры

Процедура КомандаПроверитьЗапрос(Команда)
	
	ВыбраннаяСтрока = СообщенияФормы.ТекущаяСтрока;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.ТипСообщения <> Перечисления.ИИА_ТипСообщения.Запрос Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ВыбраннаяСтрока.ТекстКода) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем запрос
	Результат = ИИА_Клиент.ПроверитьЗапрос(ВыбраннаяСтрока.ТекстКода);
	
	// Формируем сообщение о результате
	Если Результат.Успех Тогда
		ТекстОшибки = "Запрос выполнен успешно";
		ТипСообщенияОшибки = Перечисления.ИИА_ТипСообщения.Текст;
	Иначе
		ТекстОшибки = "Ошибка: " + Результат.Сообщение;
		ТипСообщенияОшибки = Перечисления.ИИА_ТипСообщения.Ошибка;
	КонецЕсли;
	
	// Добавляем системное сообщение в диалог через сервер
	ДобавитьСистемноеСообщение(ТекстОшибки, ТипСообщенияОшибки);
	
	// Обновляем список сообщений
	ОбновитьСообщения();
	
КонецПроцедуры

Процедура КомандаСкопировать(Команда)
	
	ВыбраннаяСтрока = СообщенияФормы.ТекущаяСтрока;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.ТипСообщения <> Перечисления.ИИА_ТипСообщения.Запрос Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ВыбраннаяСтрока.ТекстКода) Тогда
		Возврат;
	КонецЕсли;
	
	// Копируем в буфер обмена
	Попытка
		БуферОбмена.ЗаписатьТекст(ВыбраннаяСтрока.ТекстКода);
		Сообщить("Запрос скопирован в буфер обмена");
	Исключение
		Сообщить("Ошибка копирования в буфер обмена: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура КомандаНастройки(Команда)
	
	// Открываем форму настроек пользователя
	// TODO: Реализовать открытие формы настроек
	
	Сообщить("Настройки (в разработке)");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииКлиентскогоМодуля

// Обновляет список сообщений на форме
//
Процедура ОбновитьСообщения()
	
	СообщенияФормы = ИИА_Клиент.ЗагрузитьСообщенияДиалога(ТекущийДиалог);
	
	СообщенияФормы.Отбор.Очистить();
	
КонецПроцедуры

// Добавляет системное сообщение в диалог
//
// Параметры:
//  Текст - Строка - текст сообщения
//  ТипСообщения - ПеречислениеСсылка.ИИА_ТипСообщения - тип сообщения
//
Процедура ДобавитьСистемноеСообщение(Текст, ТипСообщения)
	
	ВызватьСерверныйМетод("ДобавитьСистемноеСообщениеНаСервере", ТекущийДиалог, Текст, ТипСообщения);
	
КонецПроцедуры

#КонецОбласти

&НаСервере

// Добавляет системное сообщение в диалог (серверная процедура)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Текст - Строка - текст сообщения
//  ТипСообщения - ПеречислениеСсылка.ИИА_ТипСообщения - тип сообщения
//
Процедура ДобавитьСистемноеСообщениеНаСервере(СсылкаДиалога, Текст, ТипСообщения)
	
	ИИА_Сервер.ДобавитьСообщениеВДиалог(
		СсылкаДиалога,
		Перечисления.ИИА_АвторСообщения.Система,
		ТипСообщения,
		Текст,
		"",
		"",
		0
	);
	
КонецПроцедуры

&НаКлиенте
